bugs/wooyun-2015-0136075.json

{"id": 65728, "wybug_id": "wooyun-2015-0136075", "wybug_title": "比亚迪某平台多处sql注入打包，数据库可被远程访问，服务器可getshell", "wybug_corp": "bydauto.com.cn", "wybug_author": "纳米翡翠", "wybug_date": "2015-08-22 15:09", "wybug_open_date": "2015-10-09 16:44", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-08-22：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-08-25：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-09-04：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-09-14：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-09-24：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-10-09：\t细节向公众公开  简要描述： 和上次一样，求20rank 详细说明：  1.打开比亚迪充电站平台，http://charge.bydauto.com.cn/随便打开一个电站，点详情，抓包\n\n\n\n其中stationid处存在注入，将数据包导入sqlmap，跑出数据库\n\n2.下载比亚迪充电APP从比亚迪云服务app的推荐里面下载比亚迪充电app抓包后发现app与server间通过webservice通信，其url为：http://charge.bydauto.com.cn/charge/Service.asmx其中的GetPilesByPage2方法的stationId处存在注入\n\n抓包内容如下：\nPOST http://charge.bydauto.com.cn/charge/Service.asmx HTTP/1.1User-Agent: kSOAP/2.0SOAPAction: http://tempuri.org/GetPilesByPage2Content-Type: text/xmlConnection: closeContent-Length: 458Host: charge.bydauto.com.cnAccept-Encoding: gzip<v:Envelope xmlns:i=\"http://www.w3.org/1999/XMLSchema-instance\" xmlns:d=\"http://www.w3.org/1999/XMLSchema\" xmlns:c=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:v=\"http://schemas.xmlsoap.org/soap/envelope/\"><v:Header /><v:Body><GetPilesByPage2 xmlns=\"http://tempuri.org/\" id=\"o0\" c:root=\"1\"><stationId i:type=\"d:string\">asz1230440*</stationId><language i:type=\"d:int\">0</language><pageNo i:type=\"d:int\">1</pageNo></GetPilesByPage2></v:Body></v:Envelope>\n保存后丢到sqlmap里面，便可跑出数据库\n\n通过对比发现app与网站使用的是同一个库，可以肯定该库是线上环境3.getshell通过sqlmap跑出当前用户是sa，于是尝试xp_cmdshell\n\n4.成功getshell,执行了一下ipconfig，如下\n\n5.拿到IP后尝试了一下本地登录，竟然可以本地访问，于是爆破了一下hash\n\n拿到hash后解密，成功登录到数据库里面\n\n好多库子的样子\n\n看了一下里面有大量的计费信息，如果不错的话应该可以就库充值吧。没敢操作，就这样吧。\n\n   漏洞证明：     修复方案：  用sa不妥吧   版权声明：转载请注明来源 纳米翡翠@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2015-08-25 16:43 厂商回复： 问题已修复，非常感谢支持。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}